Repository: Rebel-Gloria/PRTS
Catalog: PRTS/Localizable.xcstrings
Source language: en
Languages: zh_hans

# accessibility.camera.permissionDenied
source: Camera permission denied. Enable camera access in iOS Settings, then try again.
zh_hans: 摄像头权限被拒绝。请在 iPhone 设置中允许摄像头权限，然后重试。

# accessibility.camera.ready
source: Camera ready.
zh_hans: 摄像头已准备就绪。

# accessibility.camera.requestingPermission
source: Requesting camera permission.
zh_hans: 正在请求摄像头权限。

# accessibility.camera.running
source: Camera is live.
zh_hans: 摄像头正在运行。

# accessibility.camera.starting
source: Starting camera.
zh_hans: 正在启动摄像头。

# accessibility.camera.unavailable
source: Camera unavailable. %@
zh_hans: 摄像头不可用。%@

# app.home
source: PRTS home
zh_hans: PRTS 首页

# camera.error.cannotAddInput
source: The rear camera could not be connected.
zh_hans: 无法连接后置摄像头。

# camera.error.cannotAddOutput
source: The camera video output could not be created.
zh_hans: 无法创建摄像头视频输出。

# camera.error.noRearCamera
source: No rear camera was found on this device.
zh_hans: 此设备未找到后置摄像头。

# camera.error.sessionStartFailed
source: The camera session could not be started.
zh_hans: 无法启动摄像头会话。

# camera.error.unknownPermission
source: The camera permission state is unknown.
zh_hans: 摄像头权限状态未知。

# camera.status.idle
source: Ready to start
zh_hans: 准备开始

# camera.status.permissionDenied
source: Camera permission denied
zh_hans: 摄像头权限被拒绝

# camera.status.requestingPermission
source: Waiting for camera permission
zh_hans: 正在等待摄像头权限

# camera.status.running
source: Camera is live
zh_hans: 摄像头正在运行

# camera.status.starting
source: Starting camera
zh_hans: 正在启动摄像头

# camera.status.unavailable
source: Camera unavailable
zh_hans: 摄像头不可用

# home.backend.framesConverted %lld
source: Frames converted: %lld · mode: minimal
zh_hans: 已转换帧数：%lld · 模式：最简

# home.camera.button.start
source: Start
zh_hans: 开始

# home.camera.button.start.hint
source: Starts the rear camera and shows the live preview
zh_hans: 启动后置摄像头并显示实时预览

# home.camera.button.start.label
source: Start camera
zh_hans: 开始摄像头

# home.camera.button.stop
source: Stop
zh_hans: 停止

# home.camera.button.stop.hint
source: Stops the live camera preview
zh_hans: 停止实时摄像头预览

# home.camera.button.stop.label
source: Stop camera
zh_hans: 停止摄像头

# home.camera.button.stopLongPress
source: Press and hold to stop
zh_hans: 长按停止

# home.camera.button.stopLongPress.hint
source: Keep holding for one second to stop the camera
zh_hans: 持续按住一秒停止摄像头

# home.camera.preview.off.hint
source: Use the Start button at the bottom of the screen to begin
zh_hans: 使用屏幕底部的开始按钮启动

# home.camera.preview.off.label
source: Camera preview is off
zh_hans: 摄像头预览已关闭

# home.camera.preview.subtitle
source: Tap Start when you are ready
zh_hans: 准备好后点击开始

# home.camera.preview.title
source: Camera preview
zh_hans: 摄像头预览

# home.camera.status.label
source: Camera status
zh_hans: 摄像头状态

# home.command.placeholder
source: Test command (e.g. 开始导航)
zh_hans: 测试指令（例如：开始导航）

# home.command.send
source: Send
zh_hans: 发送

# home.settings.button
source: Setting
zh_hans: 设置

# home.settings.hint
source: Opens video and voice options
zh_hans: 打开视频和语音选项

# home.settings.label
source: Settings
zh_hans: 设置

# settings.back
source: Back
zh_hans: 返回

# settings.feedback.haptic
source: Haptic feedback
zh_hans: 触觉反馈

# settings.feedback.haptic.hint
source: Enables or disables haptic feedback for app interactions
zh_hans: 开启或关闭应用交互的触觉反馈

# settings.feedback.section
source: Feedback
zh_hans: 反馈

# settings.language.followSystem
source: Follow system language
zh_hans: 跟随系统语言

# settings.language.followSystem.hint
source: Uses the iPhone language for automatic speech
zh_hans: 自动语音播报使用 iPhone 语言

# settings.language.followSystem.offHint
source: Disabled while Follow system language is on
zh_hans: 开启跟随系统语言时不可用

# settings.language.footer
source: When enabled, speech follows the iPhone language. Turn it off to choose English or Chinese.
zh_hans: 开启后，语音播报跟随 iPhone 语言。关闭后可选择英语或中文。

# settings.language.name.chinese
source: Chinese
zh_hans: 中文

# settings.language.name.english
source: English
zh_hans: 英语

# settings.language.picker
source: Language
zh_hans: 语言

# settings.language.picker.chooseHint
source: Selects the language for automatic speech
zh_hans: 选择自动语音播报的语言

# settings.language.picker.disabledHint
source: Disabled while Follow system language is on
zh_hans: 开启跟随系统语言时不可用

# settings.language.section
source: Language
zh_hans: 语言

# settings.rate.fast
source: Fast
zh_hans: 快速

# settings.rate.normal
source: Normal
zh_hans: 正常

# settings.rate.slow
source: Slow
zh_hans: 慢速

# settings.runtime.asr
source: Enable ASR (on-demand)
zh_hans: 启用自动语音识别（按需加载）

# settings.runtime.brain
source: Enable brain / VLM (experimental)
zh_hans: 启用大脑 / 视觉语言模型（实验性）

# settings.runtime.maps
source: Enable maps
zh_hans: 启用地图

# settings.runtime.perception
source: Enable perception (segmentation + detection)
zh_hans: 启用感知（语义分割 + 目标检测）

# settings.runtime.profile
source: Runtime profile
zh_hans: 运行档位

# settings.runtime.profile.fullExperimental
source: Full / experimental — opt in explicitly
zh_hans: 完整 / 实验模式 — 仅手动开启

# settings.runtime.profile.minimal
source: Minimal — interface, camera, system speech, contracts
zh_hans: 最简模式 — 界面、相机、系统语音播报与契约解析

# settings.runtime.profile.perception
source: Perception — segmentation and obstacle detection (when available)
zh_hans: 感知模式 — 语义分割与障碍物检测（资源可用时）

# settings.runtime.section
source: Runtime and models
zh_hans: 运行模式与模型

# settings.runtime.unavailable
source: Model features remain unavailable until the pinned Apple runtime and model files are supplied. Full / experimental is never selected automatically.
zh_hans: 在提供固定版本的 Apple 运行时和模型文件之前，模型功能不可用。应用不会自动选择完整 / 实验模式。

# settings.title
source: Settings
zh_hans: 设置

# settings.voice.announcements
source: Voice announcements
zh_hans: 语音播报

# settings.voice.announcements.hint
source: Turns automatic spoken page and status announcements on or off
zh_hans: 开启或关闭页面和状态的自动语音播报

# settings.voice.announcements.off
source: Off
zh_hans: 关闭

# settings.voice.announcements.on
source: On
zh_hans: 开启

# settings.voice.rate
source: Speech rate
zh_hans: 播报速度

# settings.voice.rate.hint
source: Changes the speed of automatic spoken announcements
zh_hans: 调整自动语音播报的速度

# settings.voice.section
source: Voice
zh_hans: 语音

# speech.camera.idle
source: Camera is not on.
zh_hans: 摄像头未开启。

# speech.camera.liveStatus
source: Camera is live
zh_hans: 摄像头正在运行

# speech.camera.permissionDenied
source: Camera permission denied. Enable camera access in iOS Settings, then try again.
zh_hans: 摄像头权限被拒绝。请在 iPhone 设置中允许摄像头权限，然后重试。

# speech.camera.readyStatus
source: Camera is not on
zh_hans: 摄像头未开启

# speech.camera.requestingPermission
source: Requesting camera permission.
zh_hans: 正在请求摄像头权限。

# speech.camera.running
source: Camera is live.
zh_hans: 摄像头正在运行。

# speech.camera.startAction
source: Start button at the bottom of the screen.
zh_hans: “开始”按钮在屏幕下方。

# speech.camera.starting
source: Starting camera.
zh_hans: 正在启动摄像头。

# speech.camera.stopAction
source: Press and hold to stop button.
zh_hans: “长按停止”按钮。

# speech.camera.unavailable
source: Camera unavailable. %@
zh_hans: 摄像头不可用。%@

# speech.haptic.changed
source: Haptic feedback is %@.
zh_hans: 触觉反馈已%@。

# speech.home
source: PRTS home. %@. %@. Settings button at the top right.
zh_hans: PRTS 首页。%@。%@。“设置”按钮在右上角。

# speech.language.custom
source: Language: Custom: %@
zh_hans: 语言：自定义：%@

# speech.language.followSystem
source: Language: Follow system settings
zh_hans: 语言：跟随系统设置

# speech.rate.changed
source: Speech rate %@.
zh_hans: 播报速度为%@。

# speech.settings.summary
source: Settings. Voice announcements are %@. Speech rate is %@. %@. Haptic feedback is %@.
zh_hans: 设置。语音播报已%@。播报速度为%@。%@。触觉反馈已%@。

# speech.value.off
source: off
zh_hans: 关闭

# speech.value.on
source: on
zh_hans: 开启

# speech.voice.disabled
source: Voice announcements off.
zh_hans: 语音播报已关闭。

# speech.voice.enabled
source: Voice announcements on.
zh_hans: 语音播报已开启。
